; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v2 - type_1 ?v6 - type_2)
 	      (pred_4 ?v3 - object ?v6 - type_2)
	      (pred_2 ?v2 - type_1 ?v1 - type_3)
	      (pred_3 ?v2 - type_1 ?v3 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v2 - type_1 ?v5 ?v7 - type_2)
       :precondition (and  (pred_1 ?v2 ?v5))
       :effect (and  (pred_1 ?v2 ?v7)
		     (not (pred_1 ?v2 ?v5))))

   (:action op_3
       :parameters (?v2 - type_1 ?v8 - object ?v4 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v4) (pred_1 ?v2 ?v4) (pred_2 ?v2 ?v1))
       :effect (and (pred_3 ?v2 ?v8 ?v1)
		    (not (pred_4 ?v8 ?v4)) 
		    (not (pred_2 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_1 ?v8 - object ?v4 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v8 ?v1) (pred_1 ?v2 ?v4))
       :effect (and (pred_4 ?v8 ?v4)
		    (pred_2 ?v2 ?v1)
		    (not (pred_3 ?v2 ?v8 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_02 - type_1
obj_12 obj_10 obj_06 obj_03 - type_3
obj_13 obj_01 obj_04 obj_08 - type_2
obj_11 obj_05 obj_14 obj_09 - object)
(:init
(pred_1 obj_07 obj_01)
(pred_2 obj_07 obj_12)
(pred_2 obj_07 obj_10)
(pred_1 obj_02 obj_08)
(pred_2 obj_02 obj_06)
(pred_2 obj_02 obj_03)
(pred_4 obj_11 obj_08)
(pred_4 obj_05 obj_13)
(pred_4 obj_14 obj_08)
(pred_4 obj_09 obj_08)
)
(:goal
(and
(pred_4 obj_11 obj_04)
(pred_4 obj_05 obj_08)
(pred_4 obj_14 obj_01)
(pred_4 obj_09 obj_13)
)
)

(:constraints
  (always (not (pred_1 obj_07 obj_04)))
)
)

; plan
1. (op_2 obj_07 obj_01 obj_13)
   deleted: (pred_1 obj_07 obj_01)
   added: (pred_1 obj_07 obj_13)
   goals met: 0 of 4
2. (op_3 obj_02 obj_14 obj_08 obj_03)
   deleted: (pred_4 obj_14 obj_08) (pred_2 obj_02 obj_03)
   added: (pred_3 obj_02 obj_14 obj_03)
   goals met: 0 of 4
3. (op_3 obj_02 obj_11 obj_08 obj_06)
   deleted: (pred_4 obj_11 obj_08) (pred_2 obj_02 obj_06)
   added: (pred_3 obj_02 obj_11 obj_06)
   goals met: 0 of 4
4. (op_2 obj_02 obj_08 obj_04)
   deleted: (pred_1 obj_02 obj_08)
   added: (pred_1 obj_02 obj_04)
   goals met: 0 of 4
5. (op_3 obj_07 obj_05 obj_13 obj_10)
   deleted: (pred_4 obj_05 obj_13) (pred_2 obj_07 obj_10)
   added: (pred_3 obj_07 obj_05 obj_10)
   goals met: 0 of 4
6. (op_1 obj_02 obj_11 obj_04 obj_06)
   deleted: (pred_3 obj_02 obj_11 obj_06)
   added: (pred_4 obj_11 obj_04) (pred_2 obj_02 obj_06)
   goals met: 1 of 4
7. (op_2 obj_07 obj_13 obj_08)
   deleted: (pred_1 obj_07 obj_13)
   added: (pred_1 obj_07 obj_08)
   goals met: 1 of 4
8. (op_2 obj_02 obj_04 obj_01)
   deleted: (pred_1 obj_02 obj_04)
   added: (pred_1 obj_02 obj_01)
   goals met: 1 of 4
9. (op_1 obj_07 obj_05 obj_08 obj_10)
   deleted: (pred_3 obj_07 obj_05 obj_10)
   added: (pred_4 obj_05 obj_08) (pred_2 obj_07 obj_10)
   goals met: 2 of 4
10. (op_3 obj_07 obj_09 obj_08 obj_12)
   deleted: (pred_4 obj_09 obj_08) (pred_2 obj_07 obj_12)
   added: (pred_3 obj_07 obj_09 obj_12)
   goals met: 2 of 4
11. (op_1 obj_02 obj_14 obj_01 obj_03)
   deleted: (pred_3 obj_02 obj_14 obj_03)
   added: (pred_4 obj_14 obj_01) (pred_2 obj_02 obj_03)
   goals met: 3 of 4
12. (op_2 obj_07 obj_08 obj_13)
   deleted: (pred_1 obj_07 obj_08)
   added: (pred_1 obj_07 obj_13)
   goals met: 3 of 4
13. (op_1 obj_07 obj_09 obj_13 obj_12)
   deleted: (pred_3 obj_07 obj_09 obj_12)
   added: (pred_4 obj_09 obj_13) (pred_2 obj_07 obj_12)
   goals met: 4 of 4
